Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.HookedEndSymbolTypes Enumeration
 The available hooked end symbol types. See Tekla Structures help, "Reinforcement appearance", for more information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum HookedEndSymbolTypes
Public Enumeration HookedEndSymbolTypes
Members
Member name | Value | Description
NoHook | 1 | No hook symbol.
HalfHook | 2 | The half hook symbol.
FullHook | 3 | The full hook symbol.
See Also
Reference
Tekla.Structures.Drawing Namespace